#!/bin/bash
subtitle=$(sed -n '/__SUBTITLES__/,+100p' $0 | shuf -n1)
sed -i '/^  sub:/a@@@@- '$subtitle'' _config.butterfly.yml
sed -i '/^@@@@/s/@/ /g' _config.butterfly.yml
exit

__SUBTITLES__
既然选择远方，当不负青春，砥砺前行。
青春由磨砺而出彩，人生因奋斗而升华！
但行前路，不负韶华！
每一个裂缝都是为透出光而努力
美好的一天，上帝不会就这样给你，需要自己去创造。
你要做冲出的黑马 而不是坠落的星星。
纵然世间黑暗，仍有一点星光。
试一下，你会比你自己想象中的还要强大
眼里有不朽的光芒 心里有永恒的希望
等待的不仅仅是未来，还有希望…
只有极致的拼搏，才能配得上极致的风景。
如果痛恨所处的黑暗，请你成为你想要的光。 —— 顾城
以蝼蚁之行，展鸿鹄之志。
一个人至少拥有一个梦想，有一个理由去坚强。
你可以一无所有，但绝不能一无是处。
努力的时间还不够 哪有时间去绝望啊 —— 余安
彗星般的人生可以短暂，但绝不黯淡或沉沦。 —— 纳兰容若
抱怨身处黑暗，不如提灯前行。 —— 刘同《向着光亮那方》
黑暗的笼罩更会凸显光明的可贵。
你要成长，绝处也能逢生
心态决定高度，细节决定成败。
没人会嘲笑竭尽全力的人。 —— 《家庭教师》
上天是公平的，有付出就有收获。
生活很苦，但不要放弃爱与希望 —— 《送你一朵小红花》
过去的价值不代表未来的地位。
惟有主动付出，才有丰富的果实获得收获。
站在死亡面前并不可怕，可怕的是不能牺牲的有所价值。
存在是因为价值创造!淘汰是因为价值丧失。
价值的真正意义在于宁愿牺牲自己，也不愿拖累他人的精神。
当你全心全意为一个人付出时，这个人往往会背叛你。因为你已经全然付出，从而毫无新鲜感和利用价值。
人生一世，总有个追求，有个盼望，有个让自己珍视，让自己向往，让自己护卫，愿意为之活一遭，乃至愿意为之献身的东西，这就是价值了。
什么都不懂的人是毫无价值的。
无私的奉献不仅可以帮助别人，也会在无形中提升自己的价值。
价值不等同于付出，但是付出却可以换来价值。
任务在无形中完成，价值在无形中升华。
个人与不一样的人在一起也会出现不一样的价值!一个人与不一样的平台也会体现不同的价值。
面对生活，不能无欲无求，但也不能过度强求，贫富只是身外之物的落差，不代表生存的价值。
当我们远离了言语与是非，我们的一切存在也就真实地显露了本来的价值。
你若喜爱你本身的价值，那么你就得给世界创造价值。
人们总是喜欢高估自己所没有的东西的价值，而忽视自己本身所拥有的东西。
精彩的人生是在有限生命中实现无限价值的人生。
人一生的价值，不应该用时间去衡量，而是用深度去衡量。
成功最重要的因素是要有一个健康的身体和旺盛的精力。
成功之花，人们往往惊羡它现时的明艳，然而当初，它的芽儿却浸透了奋斗的泪泉，洒满了牺牲的血雨。
成功是陡峭的阶梯，两手插在裤袋里是爬不上去的。
成功没有奇迹，只有轨迹；成功不靠条件，只靠信念!
成功就是失败到失败，也丝毫不减当初的热情。
成功的关键，在于勇敢承担责任。
成功的道路别自己一个人摸索，只有多问路才不会迷路。
努力不一定成功，但放弃一定会失败。
自己战胜自己是最可贵的胜利。
成功没有什么秘诀，如果真的有，也就两个，第一个就是坚持到底，永不放弃；第二个是当你想放弃的时候，回过头来看看第一个秘诀。
人生虽曲折，记得活出精彩。
怕的不是做不到，而是想都不敢想。
此刻打盹，你将做梦；此刻学习，你将圆梦。
得之坦然，失之淡然，争取必然，顺其自然。
世界的模样，取决你凝视它的目光。
现在睡觉的话会做梦，而现在学习的话会让梦实现。
那些比我强大的人都还在拼命。我有什麽理由不去努力。
当你想要放弃的时候想想当初为什么坚持到这里。
以良好的心态面对生活，你的生活才美好。
把握现在、就是创造未来。
人最大的对手，就是自己的懒惰。
人生不求与人相比，但求超越自己。
无论何时，不管怎样，我也绝不允许自己有一点点心丧气。 —— 爱迪生
笨鸟先飞早入林，笨人勤学早成材 —— 《省世格言》
成功是由日复一日的点滴努力汇聚而成的。
一个有坚强心志的人，财产可以被人掠夺，勇气却不会被人剥夺的。 —— 雨果
迈开脚步，再长的路也不在话下；停滞不前，再短的路也难以到达。
梦想从这刻起，并不只是个幻想，靠自己它能成为现实中的一部分。
为了未来好一点，现在苦一点有什么。
只有承担起旅途风雨，最终才能守得住彩虹满天。
苦想没有盼头，苦干才有奔头。
所有的努力 不是为了让别人觉得你了不起 而是让自己过得充实而有追求
坚持意志伟大的事业需要始终不渝的精神。 —— 伏尔泰
不要垂头丧气，即使失去一切，明天仍在你的手里。 —— 奥丅斯卡·王尔德
既然我已经踏上这条道路，那么，任何东西都不应妨碍我沿着这条路走下去。 —— 康德
欲穷千里目，更上一层楼。 —— 王之涣
第一个青春是上天给的；第二个的青春是靠自己努力的。
每个梦想，都是在现实中坚持不懈才实现的。
只要路是对的，就不怕路远。
成功的秘诀之一就是不让暂时的挫折击垮我们。
只有不断找寻机会的人才会及时把握机会。
没有口水与汗水，就没有成功的泪水。
勤奋是你生命的密码，能译出你一部壮丽的史诗。
志在山顶的人，不会贪念山腰的风景。
选定一条路，坚定不移地走下去，只要你坚定梦想，即使前方是死胡同，你可以开辟出一条新的道路出来。
所有的胜利，与征服自己的胜利比起来，都是微不足道。
人生最宝贵的不是你拥有多少的物质，而是陪伴在你身边的人。
奋斗者在汗水汇集的江河里，将事业之舟驶到了理想的彼岸。
帮别人的事做完就忘记，别人为自己做的事时时记着，哪怕这个人只有那么一次好，他也是曾经帮助过你的人。
人生不可能总是顺心如意的，但是持续朝着阳光走，影子就会躲在后面。刺眼，却表明对的方向。
努力去做自己该做的，但是不要期待回报，不是付出了就会有回报的，做了就不要后悔，不做才后悔。
生活的道路一旦选定，就要勇敢地走到底，决不回头。
天才是百分之一的灵感加上百分之九十九的努力。
只有经历地狱般的磨练，才能炼出创造天堂的力量。
萤火虫的光点虽然微弱，但亮着便是向黑暗挑战。
在很多人看来，失败是可耻的，但其实，失败才是常态。
人不是因为没有信念而失败，而是因为不能把信念化成行动，并且坚持到底。 —— 戴尔·卡耐基
一个人失败的最大原因，就是对于自己的能力永远不敢充分信任，甚至自己认为必将失败无疑。 —— 富兰克林
